Revit 2027 API
BuiltInFailures.MassFailures.SplitFacesByGroundPlaneFailed Property
 Failed to split face by ground plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SplitFacesByGroundPlaneFailed { get; }
Public Shared ReadOnly Property SplitFacesByGroundPlaneFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SplitFacesByGroundPlaneFailed {
	FailureDefinitionId^ get ();
}
static member SplitFacesByGroundPlaneFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace